In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [22]:
data = pd.read_excel('./fill_na.xlsx',parse_dates=['date'])
data.head()

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07          NaN        NaN     NaN
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09          NaN   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy

### Filling a common value to all missing data

In [3]:
data.fillna(0)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07       0.0000   0.000000       0
2 2020-05-08      30.9343   0.000000   rainy
3 2020-05-09       0.0000   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382   0.000000   sunny

### Adding missing data to individual columns

In [4]:
column_base_filling = data.fillna({'temperature':10,'windSpeed':10,'status':'sunny'})
column_base_filling

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      10.0000  10.000000   sunny
2 2020-05-08      30.9343  10.000000   rainy
3 2020-05-09      10.0000   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  10.000000   sunny

### We can access individual columns by an alternative way also

In [5]:
data.status.fillna('windy')

0     sunny
1     windy
2     rainy
3    cloudy
4     rainy
5     sunny
Name: status, dtype: object

### Forward fill (row)
Forward fill is a method to forward the data from the row above the missing value. Thus all the
missing value will get filled with the value above. If there are multiple missing values
consecutively , they will also get filled with the same value of the above available data.

In [6]:
data.fillna(method="ffill")

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343  10.788378   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

### Backward fill (row)

In [7]:
data.fillna(method='bfill')

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      30.9343   6.889682   rainy
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

### Forward fill (column)

In [8]:
column_fill =data.fillna(method="ffill",axis=1)
column_fill

        date          temperature            windSpeed               status
0 2020-05-06              35.6582            10.788378                sunny
1 2020-05-07  2020-05-07 00:00:00  2020-05-07 00:00:00  2020-05-07 00:00:00
2 2020-05-08              30.9343              30.9343                rainy
3 2020-05-09  2020-05-09 00:00:00             6.889682               cloudy
4 2020-05-10              13.9082             19.01299                rainy
5 2020-05-11              23.9382              23.9382                sunny

###### another way

In [9]:
data.fillna(method='ffill',axis='columns')

        date          temperature            windSpeed               status
0 2020-05-06              35.6582            10.788378                sunny
1 2020-05-07  2020-05-07 00:00:00  2020-05-07 00:00:00  2020-05-07 00:00:00
2 2020-05-08              30.9343              30.9343                rainy
3 2020-05-09  2020-05-09 00:00:00             6.889682               cloudy
4 2020-05-10              13.9082             19.01299                rainy
5 2020-05-11              23.9382              23.9382                sunny

### Backward fill(column)

In [10]:
data.fillna(method='bfill',axis='columns')

        date temperature  windSpeed  status
0 2020-05-06     35.6582  10.788378   sunny
1 2020-05-07         NaT        NaT     NaT
2 2020-05-08     30.9343      rainy   rainy
3 2020-05-09    6.889682   6.889682  cloudy
4 2020-05-10     13.9082   19.01299   rainy
5 2020-05-11     23.9382      sunny   sunny

### Limiting the forward/backward fill

In [11]:
data.fillna(method='ffill',limit=1)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

In [12]:
data.fillna(method='bfill',limit=1)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      30.9343        NaN   rainy
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

### Filling with pandas objects like sum, max,min,mean
There are many Pandas objects like df.sum(),df.max() etc. we can fill the missing values with these too.

In [13]:
data.fillna(data.mean())

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

##### data is filled with mean

In [14]:
data.fillna(data.min())

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      13.9082   6.889682     NaN
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382   6.889682   sunny

##### Data is filled with minimum value of the column

In [15]:
data.fillna(data.mode())

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      23.9382  10.788378   sunny
2 2020-05-08      30.9343  19.012990   rainy
3 2020-05-09      35.6582   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

##### Here, we have 2 columns having same number of occurance .so, the windspeed of 5th row couldn't be updated

### Filling mean value for specific range of columns
We can do filling for a specific range of column too as:

In [16]:
data.fillna(data.mean()['temperature':'windSpeed'])

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

##### filled missing values with mean of that column within a specific range(here from temperature to windspeed)

In [17]:
data.fillna(data.mean()['temperature'])

        date  temperature  windSpeed     status
0 2020-05-06    35.658200  10.788378      sunny
1 2020-05-07    26.109725  26.109725  26.109725
2 2020-05-08    30.934300  26.109725      rainy
3 2020-05-09    26.109725   6.889682     cloudy
4 2020-05-10    13.908200  19.012990      rainy
5 2020-05-11    23.938200  26.109725      sunny

##### Here we can only assign values of the columns with range or can assign a single column

### Interpolate missing value
In short, interpolation is a process of determining the unknown values that lie in between the
known data points. We can interpolate missing values based on different methods. This is done
by an object in DataFrame as interpolate() . By default, interpolate() does linear interpolation.

#### Linear interpolate
Linear interpolation involves estimating a new value by connecting two adjacent known values
with a straight line.

In [18]:
data.temperature.interpolate()

0    35.65820
1    33.29625
2    30.93430
3    22.42125
4    13.90820
5    23.93820
Name: temperature, dtype: float64

##### for filling the 1st index column , first we took the 0th and 2nd index values and finds it's mean. this mean value is the value of interpolate

In [19]:
data.head()

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07          NaN        NaN     NaN
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09          NaN   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy

#### Using interpolate if there is 2 alternative null values

In [20]:
data.windSpeed.interpolate()

0    10.788378
1     9.488813
2     8.189247
3     6.889682
4    19.012990
5    19.012990
Name: windSpeed, dtype: float64

##### Here 1st and 2nd index have missing values.

##### For finding the above 2 values we use slope method.we substract 3rd index value from 0th index value - (1)                       then substract their indexes(3 and 0 as well) - (2)

##### Then, we divide (1) by (2) and find a result

##### Add this result to the first index or lower value (here 0th index)

##### from this way, we can find the 1st and 2nd index values

### Time interpolate
time-weighted interpolation only works on Series or DataFrames with a DatetimeIndex

##### first we have to check whether this date is in datetime format

##### Then, set the date column as index

In [28]:
time_index_data = data.set_index('date')
time_index_data

            temperature  windSpeed  status
date
2020-05-06      35.6582  10.788378   sunny
2020-05-07          NaN        NaN     NaN
2020-05-08      30.9343        NaN   rainy
2020-05-09          NaN   6.889682  cloudy
2020-05-10      13.9082  19.012990   rainy
2020-05-11      23.9382        NaN   sunny

In [29]:
time_index_data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2020-05-06 to 2020-05-11
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   temperature  4 non-null      float64
 1   windSpeed    3 non-null      float64
 2   status       5 non-null      object
dtypes: float64(2), object(1)
memory usage: 192.0+ bytes

In [30]:
time_index_data.interpolate(method='time')

            temperature  windSpeed  status
date
2020-05-06     35.65820  10.788378   sunny
2020-05-07     33.29625   9.488813     NaN
2020-05-08     30.93430   8.189247   rainy
2020-05-09     22.42125   6.889682  cloudy
2020-05-10     13.90820  19.012990   rainy
2020-05-11     23.93820  19.012990   sunny

In [34]:
data

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07          NaN        NaN     NaN
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09          NaN   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

### Other methods

##### barycentric

In [32]:
data.temperature.interpolate(method='barycentric')

0    35.65820
1    39.46530
2    30.93430
3    19.32775
4    13.90820
5    23.93820
Name: temperature, dtype: float64

#### pchip

In [33]:
data.temperature.interpolate(method='pchip')

0    35.658200
1    34.220728
2    30.934300
3    21.496772
4    13.908200
5    23.938200
Name: temperature, dtype: float64

#### akima

In [35]:
data.temperature.interpolate(method='akima')

0    35.658200
1    34.448184
2    30.934300
3    22.421250
4    13.908200
5    23.938200
Name: temperature, dtype: float64

#### spline

In [38]:
data.temperature.interpolate(method='spline',order=2)

0    35.658200
1    35.076089
2    30.934300
3    20.526966
4    13.908200
5    23.938200
Name: temperature, dtype: float64

#### polynomial

In [46]:
data.temperature.interpolate(method='polynomial',order = 2)

0    35.658200
1    36.196165
2    30.934300
3    19.872606
4    13.908200
5    23.938200
Name: temperature, dtype: float64

##### using the equation of a line, finding a line suitable for these given value and fitting the unknown value using the line